HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_regdef.h
/** \\brief  ATOM Channel CCU1 Compare Shadow Register */
typedef struct _Ifx_GTM_ATOM_CH_SR1_Bits
{
    Ifx_Strict_32Bit SR1:24;                /**< \brief [23:0] ATOM channel x shadow register SR0 (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_ATOM_CH_SR1_Bits;

/** \\brief  ATOM Channel Status Register */
typedef struct _Ifx_GTM_ATOM_CH_STAT_Bits
{
    Ifx_Strict_32Bit OL:1;                  /**< \brief [0:0] Actual output signal level of ATOM_CHx_OUT (r) */
    Ifx_Strict_32Bit reserved_1:15;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ACBI:5;                /**< \brief [20:16] ATOM Mode control bits received through ARU (r) */
    Ifx_Strict_32Bit DV:1;                  /**< \brief [21:21] Valid ARU Data stored in compare registers (r) */
    Ifx_Strict_32Bit WRF:1;                 /**< \brief [22:22] Write request of CPU failed for late update (rwh) */
    Ifx_Strict_32Bit reserved_23:1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ACBO:5;                /**< \brief [28:24] ATOM Internal status bits (r) */
    Ifx_Strict_32Bit reserved_29:3;         /**< \brief \internal Reserved */
} Ifx_GTM_ATOM_CH_STAT_Bits;

/** \\brief  BRC Error Interrupt Enable Register */
typedef struct _Ifx_GTM_BRC_EIRQ_EN_Bits
{
    Ifx_Strict_32Bit DEST_ERR_EN:1;         /**< \brief [0:0] BRC_DEST_ERR_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN0:1;             /**< \brief [1:1] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN1:1;             /**< \brief [2:2] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN2:1;             /**< \brief [3:3] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN3:1;             /**< \brief [4:4] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN4:1;             /**< \brief [5:5] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN5:1;             /**< \brief [6:6] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN6:1;             /**< \brief [7:7] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN7:1;             /**< \brief [8:8] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN8:1;             /**< \brief [9:9] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN9:1;             /**< \brief [10:10] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN10:1;            /**< \brief [11:11] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN11:1;            /**< \brief [12:12] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit reserved_13:19;        /**< \brief \internal Reserved */
} Ifx_GTM_BRC_EIRQ_EN_Bits;

/** \\brief  BRC Interrupt Enable Register */
typedef struct _Ifx_GTM_BRC_IRQ_EN_Bits
{
    Ifx_Strict_32Bit DEST_ERR_EN:1;         /**< \brief [0:0] BRC_DEST_ERR_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN0:1;             /**< \brief [1:1] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN1:1;             /**< \brief [2:2] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN2:1;             /**< \brief [3:3] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN3:1;             /**< \brief [4:4] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN4:1;             /**< \brief [5:5] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN5:1;             /**< \brief [6:6] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN6:1;             /**< \brief [7:7] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN7:1;             /**< \brief [8:8] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN8:1;             /**< \brief [9:9] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN9:1;             /**< \brief [10:10] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN10:1;            /**< \brief [11:11] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN11:1;            /**< \brief [12:12] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit reserved_13:19;        /**< \brief \internal Reserved */
} Ifx_GTM_BRC_IRQ_EN_Bits;

/** \\brief  BRC_DEST_ERR Forcing Interrupt Register */
typedef struct _Ifx_GTM_BRC_IRQ_FORCINT_Bits
{
    Ifx_Strict_32Bit TRG_DEST_ERR:1;        /**< \brief [0:0] Trigger destination error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID0:1;            /**< \brief [1:1] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID1:1;            /**< \brief [2:2] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID2:1;            /**< \brief [3:3] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID3:1;            /**< \brief [4:4] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID4:1;            /**< \brief [5:5] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID5:1;            /**< \brief [6:6] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID6:1;            /**< \brief [7:7] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID7:1;            /**< \brief [8:8] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID8:1;            /**< \brief [9:9] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID9:1;            /**< \brief [10:10] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID10:1;           /**< \brief [11:11] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID11:1;           /**< \brief [12:12] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit reserved_13:19;        /**< \brief \internal Reserved */
} Ifx_GTM_BRC_IRQ_FORCINT_Bits;

/** \\brief  BRC IRQ Mode Configuration Register */
typedef struct _Ifx_GTM_BRC_IRQ_MODE_Bits
{
    Ifx_Strict_32Bit IRQ_MODE:2;            /**< \brief [1:0] IRQ mode selection (rw) */
    Ifx_Strict_32Bit reserved_2:30;         /**< \brief \internal Reserved */
} Ifx_GTM_BRC_IRQ_MODE_Bits;

/** \\brief  BRC Interrupt Notification Register */
typedef struct _Ifx_GTM_BRC_IRQ_NOTIFY_Bits
{
    Ifx_Strict_32Bit DEST_ERR:1;            /**< \brief [0:0] Configuration error interrupt for BRC submodule (rwh) */
    Ifx_Strict_32Bit DID0:1;                /**< \brief [1:1] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID1:1;                /**< \brief [2:2] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID2:1;                /**< \brief [3:3] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID3:1;                /**< \brief [4:4] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID4:1;                /**< \brief [5:5] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID5:1;                /**< \brief [6:6] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID6:1;                /**< \brief [7:7] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID7:1;                /**< \brief [8:8] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID8:1;                /**< \brief [9:9] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID9:1;                /**< \brief [10:10] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID10:1;               /**< \brief [11:11] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID11:1;               /**< \brief [12:12] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit reserved_13:19;        /**< \brief \internal Reserved */
} Ifx_GTM_BRC_IRQ_NOTIFY_Bits;

/** \\brief  BRC Software Reset Register */
typedef struct _Ifx_GTM_BRC_RST_Bits
{
    Ifx_Strict_32Bit RST:1;                 /**< \brief [0:0] Software reset (w) */
    Ifx_Strict_32Bit reserved_1:31;         /**< \brief \internal Reserved */
} Ifx_GTM_BRC_RST_Bits;

/** \\brief  Read Address For Input Channel 0 */
typedef struct _Ifx_GTM_BRC_SRC0_ADDR_Bits
{
    Ifx_Strict_32Bit ADDR:9;                /**< \brief [8:0] Source ARU address (rw) */
    Ifx_Strict_32Bit reserved_9:3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit BRC_MODE:1;            /**< \brief [12:12] BRC Operation mode select (rw) */
    Ifx_Strict_32Bit reserved_13:19;        /**< \brief \internal Reserved */
} Ifx_GTM_BRC_SRC0_ADDR_Bits;

/** \\brief  Destination Channels For Input Channel 0 */
typedef struct _Ifx_GTM_BRC_SRC0_DEST_Bits
{
    Ifx_Strict_32Bit EN_DEST0:1;            /**< \brief [0:0] Enable BRC destination address 0 (rw) */
    Ifx_Strict_32Bit EN_DEST1:1;            /**< \brief [1:1] Enable BRC destination address 1 (rw) */
    Ifx_Strict_32Bit EN_DEST2:1;            /**< \brief [2:2] Enable BRC destination address 2 (rw) */
    Ifx_Strict_32Bit EN_DEST3:1;            /**< \brief [3:3] Enable BRC destination address 3 (rw) */
    Ifx_Strict_32Bit EN_DEST4:1;            /**< \brief [4:4] Enable BRC destination address 4 (rw) */
    Ifx_Strict_32Bit EN_DEST5:1;            /**< \brief [5:5] Enable BRC destination address 5 (rw) */
    Ifx_Strict_32Bit EN_DEST6:1;            /**< \brief [6:6] Enable BRC destination address 6 (rw) */
    Ifx_Strict_32Bit EN_DEST7:1;            /**< \brief [7:7] Enable BRC destination address 7 (rw) */
    Ifx_Strict_32Bit EN_DEST8:1;            /**< \brief [8:8] Enable BRC destination address 8 (rw) */
    Ifx_Strict_32Bit EN_DEST9:1;            /**< \brief [9:9] Enable BRC destination address 9 (rw) */
    Ifx_Strict_32Bit EN_DEST10:1;           /**< \brief [10:10] Enable BRC destination address 10 (rw) */
    Ifx_Strict_32Bit EN_DEST11:1;           /**< \brief [11:11] Enable BRC destination address 11 (rw) */
    Ifx_Strict_32Bit EN_DEST12:1;           /**< \brief [12:12] Enable BRC destination address 12 (rw) */
    Ifx_Strict_32Bit EN_DEST13:1;           /**< \brief [13:13] Enable BRC destination address 13 (rw) */
    Ifx_Strict_32Bit EN_DEST14:1;           /**< \brief [14:14] Enable BRC destination address 14 (rw) */
    Ifx_Strict_32Bit EN_DEST15:1;           /**< \brief [15:15] Enable BRC destination address 15 (rw) */
    Ifx_Strict_32Bit EN_DEST16:1;           /**< \brief [16:16] Enable BRC destination address 16 (rw) */
    Ifx_Strict_32Bit EN_DEST17:1;           /**< \brief [17:17] Enable BRC destination address 17 (rw) */
    Ifx_Strict_32Bit EN_DEST18:1;           /**< \brief [18:18] Enable BRC destination address 18 (rw) */
    Ifx_Strict_32Bit EN_DEST19:1;           /**< \brief [19:19] Enable BRC destination address 19 (rw) */
    Ifx_Strict_32Bit EN_DEST20:1;           /**< \brief [20:20] Enable BRC destination address 20 (rw) */
    Ifx_Strict_32Bit EN_DEST21:1;           /**< \brief [21:21] Enable BRC destination address 21 (rw) */
    Ifx_Strict_32Bit EN_TRASHBIN:1;         /**< \brief [22:22] Control trash bin functionality (rw) */
    Ifx_Strict_32Bit reserved_23:9;         /**< \brief \internal Reserved */
} Ifx_GTM_BRC_SRC0_DEST_Bits;

