HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_regdef.h
/** \\brief  DPLL Time Out Value of active STATE Slope */
typedef struct _Ifx_GTM_DPLL_TOV_S_Bits
{
    Ifx_Strict_32Bit DB:10;                 /**< \brief [9:0] Decision value (fractional part) for missing STATE interrupt (rw) */
    Ifx_Strict_32Bit DW:6;                  /**< \brief [15:10] Decision value (integer part) for missing STATE interrupt (rw) */
    Ifx_Strict_32Bit reserved_16:16;        /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TOV_S_Bits;

/** \\brief  DPLL Actual Signal STATE Filter Value Register */
typedef struct _Ifx_GTM_DPLL_TS_FTV_S_Bits
{
    Ifx_Strict_32Bit STATE_FT:24;           /**< \brief [23:0] Filter value of the last valid STATE input (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TS_FTV_S_Bits;

/** \\brief  DPLL Actual Signal TRIGGER Filter Value Register */
typedef struct _Ifx_GTM_DPLL_TS_FTV_T_Bits
{
    Ifx_Strict_32Bit TRIGGER_FT:24;         /**< \brief [23:0] Filter value of the last valid TRIGGER input (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TS_FTV_T_Bits;

/** \\brief  DPLL Actual Signal STATE Time Stamp Register */
typedef struct _Ifx_GTM_DPLL_TS_S_0_Bits
{
    Ifx_Strict_32Bit STATE_TS:24;           /**< \brief [23:0] Time stamp value of the last valid STATE input (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TS_S_0_Bits;

/** \\brief  DPLL Actual Signal STATE Time Stamp Register */
typedef struct _Ifx_GTM_DPLL_TS_S_1_Bits
{
    Ifx_Strict_32Bit STATE_TS:24;           /**< \brief [23:0] Time stamp value of the last valid STATE input (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TS_S_1_Bits;

/** \\brief  DPLL Actual Signal TRIGGER Time Stamp Register */
typedef struct _Ifx_GTM_DPLL_TS_T_0_Bits
{
    Ifx_Strict_32Bit TRIGGER_TS:24;         /**< \brief [23:0] Time stamp value of the last valid TRIGGER input (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TS_T_0_Bits;

/** \\brief  DPLL Actual Signal TRIGGER Time Stamp Register */
typedef struct _Ifx_GTM_DPLL_TS_T_1_Bits
{
    Ifx_Strict_32Bit TRIGGER_TS:24;         /**< \brief [23:0] Time stamp value of the last valid TRIGGER input (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TS_T_1_Bits;

/** \\brief  DPLL Calculate Time Stamp Register */
typedef struct _Ifx_GTM_DPLL_TSAC_Bits
{
    Ifx_Strict_32Bit TSAC:24;               /**< \brief [23:0] calculated time stamp for ACTION_i (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TSAC_Bits;

/** \\brief  DPLL Time Stamp Field of STATE Events */
typedef struct _Ifx_GTM_DPLL_TSF_S_Bits
{
    Ifx_Strict_32Bit TSF_S:24;              /**< \brief [23:0] Time stamp field of STATE (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TSF_S_Bits;

/** \\brief  Data Exchange Input Control Register */
typedef struct _Ifx_GTM_DXINCON_Bits
{
    Ifx_Strict_32Bit IN00:1;                /**< \brief [0:0] Input 0x Control (rw) */
    Ifx_Strict_32Bit IN01:1;                /**< \brief [1:1] Input 0x Control (rw) */
    Ifx_Strict_32Bit IN02:1;                /**< \brief [2:2] Input 0x Control (rw) */
    Ifx_Strict_32Bit IN03:1;                /**< \brief [3:3] Input 0x Control (rw) */
    Ifx_Strict_32Bit IN04:1;                /**< \brief [4:4] Input 0x Control (rw) */
    Ifx_Strict_32Bit IN05:1;                /**< \brief [5:5] Input 0x Control (rw) */
    Ifx_Strict_32Bit reserved_6:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit IN10:1;                /**< \brief [8:8] Input 1x Control (rw) */
    Ifx_Strict_32Bit IN11:1;                /**< \brief [9:9] Input 1x Control (rw) */
    Ifx_Strict_32Bit IN12:1;                /**< \brief [10:10] Input 1x Control (rw) */
    Ifx_Strict_32Bit IN13:1;                /**< \brief [11:11] Input 1x Control (rw) */
    Ifx_Strict_32Bit IN14:1;                /**< \brief [12:12] Input 1x Control (rw) */
    Ifx_Strict_32Bit IN15:1;                /**< \brief [13:13] Input 1x Control (rw) */
    Ifx_Strict_32Bit reserved_14:2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DSS00:1;               /**< \brief [16:16] Data Source Select 0x Control (rw) */
    Ifx_Strict_32Bit DSS01:1;               /**< \brief [17:17] Data Source Select 0x Control (rw) */
    Ifx_Strict_32Bit DSS02:1;               /**< \brief [18:18] Data Source Select 0x Control (rw) */
    Ifx_Strict_32Bit DSS03:1;               /**< \brief [19:19] Data Source Select 0x Control (rw) */
    Ifx_Strict_32Bit DSS04:1;               /**< \brief [20:20] Data Source Select 0x Control (rw) */
    Ifx_Strict_32Bit DSS05:1;               /**< \brief [21:21] Data Source Select 0x Control (rw) */
    Ifx_Strict_32Bit reserved_22:2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DSS10:1;               /**< \brief [24:24] Data Source Select 1x Control (rw) */
    Ifx_Strict_32Bit DSS11:1;               /**< \brief [25:25] Data Source Select 1x Control (rw) */
    Ifx_Strict_32Bit DSS12:1;               /**< \brief [26:26] Data Source Select 1x Control (rw) */
    Ifx_Strict_32Bit DSS13:1;               /**< \brief [27:27] Data Source Select 1x Control (rw) */
    Ifx_Strict_32Bit DSS14:1;               /**< \brief [28:28] Data Source Select 1x Control (rw) */
    Ifx_Strict_32Bit DSS15:1;               /**< \brief [29:29] Data Source Select 1x Control (rw) */
    Ifx_Strict_32Bit reserved_30:2;         /**< \brief \internal Reserved */
} Ifx_GTM_DXINCON_Bits;

/** \\brief  Data Exchange Output Control Register */
typedef struct _Ifx_GTM_DXOUTCON_Bits
{
    Ifx_Strict_32Bit OUT00:1;               /**< \brief [0:0] Output 0x Control (rw) */
    Ifx_Strict_32Bit OUT01:1;               /**< \brief [1:1] Output 0x Control (rw) */
    Ifx_Strict_32Bit OUT02:1;               /**< \brief [2:2] Output 0x Control (rw) */
    Ifx_Strict_32Bit OUT03:1;               /**< \brief [3:3] Output 0x Control (rw) */
    Ifx_Strict_32Bit OUT04:1;               /**< \brief [4:4] Output 0x Control (rw) */
    Ifx_Strict_32Bit OUT05:1;               /**< \brief [5:5] Output 0x Control (rw) */
    Ifx_Strict_32Bit reserved_6:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OUT10:1;               /**< \brief [8:8] Output 1x Control (rw) */
    Ifx_Strict_32Bit OUT11:1;               /**< \brief [9:9] Output 1x Control (rw) */
    Ifx_Strict_32Bit OUT12:1;               /**< \brief [10:10] Output 1x Control (rw) */
    Ifx_Strict_32Bit OUT13:1;               /**< \brief [11:11] Output 1x Control (rw) */
    Ifx_Strict_32Bit OUT14:1;               /**< \brief [12:12] Output 1x Control (rw) */
    Ifx_Strict_32Bit OUT15:1;               /**< \brief [13:13] Output 1x Control (rw) */
    Ifx_Strict_32Bit reserved_14:18;        /**< \brief \internal Reserved */
} Ifx_GTM_DXOUTCON_Bits;

