HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_regdef.h
/** \\brief  FIFO0 Channel Read Pointer Register */
typedef struct _Ifx_GTM_FIFO_CH_RD_PTR_Bits
{
    Ifx_Strict_32Bit ADDR:10;               /**< \brief [9:0] Position of the read pointer (r) */
    Ifx_Strict_32Bit reserved_10:22;        /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_RD_PTR_Bits;

/** \\brief  FIFO0 Channel Start Address Register */
typedef struct _Ifx_GTM_FIFO_CH_START_ADDR_Bits
{
    Ifx_Strict_32Bit ADDR:10;               /**< \brief [9:0] Start address for FIFOi channel x, (x07) (rw) */
    Ifx_Strict_32Bit reserved_10:22;        /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_START_ADDR_Bits;

/** \\brief  FIFO0 Channel Status Register */
typedef struct _Ifx_GTM_FIFO_CH_STATUS_Bits
{
    Ifx_Strict_32Bit EMPTY:1;               /**< \brief [0:0] FIFO is empty (r) */
    Ifx_Strict_32Bit FULL:1;                /**< \brief [1:1] FIFO is full (r) */
    Ifx_Strict_32Bit LOW_WM:1;              /**< \brief [2:2] Lower watermark reached (r) */
    Ifx_Strict_32Bit UP_WM:1;               /**< \brief [3:3] Upper watermark reached (r) */
    Ifx_Strict_32Bit reserved_4:28;         /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_STATUS_Bits;

/** \\brief  FIFO0 Channel Upper Watermark Register */
typedef struct _Ifx_GTM_FIFO_CH_UPPER_WM_Bits
{
    Ifx_Strict_32Bit ADDR:10;               /**< \brief [9:0] Upper watermark address (rw) */
    Ifx_Strict_32Bit reserved_10:22;        /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_UPPER_WM_Bits;

/** \\brief  FIFO0 Channel Write Pointer Register */
typedef struct _Ifx_GTM_FIFO_CH_WR_PTR_Bits
{
    Ifx_Strict_32Bit ADDR:10;               /**< \brief [9:0] Position of the write pointer (r) */
    Ifx_Strict_32Bit reserved_10:22;        /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_WR_PTR_Bits;

/** \\brief  GTM Infrastructure Interrupt Group */
typedef struct _Ifx_GTM_ICM_IRQG_0_Bits
{
    Ifx_Strict_32Bit ARU_NEW_DATA0_IRQ:1;   /**< \brief [0:0] ARU_NEW_DATA0 interrupt (rh) */
    Ifx_Strict_32Bit ARU_NEW_DATA1_IRQ:1;   /**< \brief [1:1] ARU_NEW_DATA1 interrupt (rh) */
    Ifx_Strict_32Bit ARU_ACC_ACK_IRQ:1;     /**< \brief [2:2] ARU_ACC_ACK interrupt (rh) */
    Ifx_Strict_32Bit BRC_IRQ:1;             /**< \brief [3:3] BRC shared submodule interrupt (rh) */
    Ifx_Strict_32Bit AEI_IRQ:1;             /**< \brief [4:4] AEI_IRQ interrupt (rh) */
    Ifx_Strict_32Bit CMP_IRQ:1;             /**< \brief [5:5] CMP shared submodule interrupt (rh) */
    Ifx_Strict_32Bit SPE0_IRQ:1;            /**< \brief [6:6] SPE0 shared submodule interrupt (rh) */
    Ifx_Strict_32Bit SPE1_IRQ:1;            /**< \brief [7:7] SPE1 shared submodule interrupt (rh) */
    Ifx_Strict_32Bit SPE2_IRQ:1;            /**< \brief [8:8] SPE2 shared submodule interrupt (rh) */
    Ifx_Strict_32Bit SPE3_IRQ:1;            /**< \brief [9:9] SPE3 shared submodule interrupt (rh) */
    Ifx_Strict_32Bit reserved_10:6;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit PSM0_CH0_IRQ:1;        /**< \brief [16:16] PSM0 shared submodule channel 0 interrupt (rh) */
    Ifx_Strict_32Bit PSM0_CH1_IRQ:1;        /**< \brief [17:17] PSM0 shared submodule channel 1 interrupt (rh) */
    Ifx_Strict_32Bit PSM0_CH2_IRQ:1;        /**< \brief [18:18] PSM0 shared submodule channel 2 interrupt (rh) */
    Ifx_Strict_32Bit PSM0_CH3_IRQ:1;        /**< \brief [19:19] PSM0 shared submodule channel 3 interrupt (rh) */
    Ifx_Strict_32Bit PSM0_CH4_IRQ:1;        /**< \brief [20:20] PSM0 shared submodule channel 4 interrupt (rh) */
    Ifx_Strict_32Bit PSM0_CH5_IRQ:1;        /**< \brief [21:21] PSM0 shared submodule channel 5 interrupt (rh) */
    Ifx_Strict_32Bit PSM0_CH6_IRQ:1;        /**< \brief [22:22] PSM0 shared submodule channel 6 interrupt (rh) */
    Ifx_Strict_32Bit PSM0_CH7_IRQ:1;        /**< \brief [23:23] PSM0 shared submodule channel 7 interrupt (rh) */
    Ifx_Strict_32Bit PSM1_CH0_IRQ:1;        /**< \brief [24:24] PSM1 shared submodule channel 0 interrupt (rh) */
    Ifx_Strict_32Bit PSM1_CH1_IRQ:1;        /**< \brief [25:25] PSM1 shared submodule channel 1 interrupt (rh) */
    Ifx_Strict_32Bit PSM1_CH2_IRQ:1;        /**< \brief [26:26] PSM1 shared submodule channel 2 interrupt (rh) */
    Ifx_Strict_32Bit PSM1_CH3_IRQ:1;        /**< \brief [27:27] PSM1 shared submodule channel 3 interrupt (rh) */
    Ifx_Strict_32Bit PSM1_CH4_IRQ:1;        /**< \brief [28:28] PSM1 shared submodule channel 4 interrupt (rh) */
    Ifx_Strict_32Bit PSM1_CH5_IRQ:1;        /**< \brief [29:29] PSM1 shared submodule channel 5 interrupt (rh) */
    Ifx_Strict_32Bit PSM1_CH6_IRQ:1;        /**< \brief [30:30] PSM1 shared submodule channel 6 interrupt (rh) */
    Ifx_Strict_32Bit PSM1_CH7_IRQ:1;        /**< \brief [31:31] PSM1 shared submodule channel 7 interrupt (rh) */
} Ifx_GTM_ICM_IRQG_0_Bits;

/** \\brief  ATOM Interrupt Group 1 */
typedef struct _Ifx_GTM_ICM_IRQG_10_Bits
{
    Ifx_Strict_32Bit ATOM4_CH0_IRQ:1;       /**< \brief [0:0] ATOM4 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM4_CH1_IRQ:1;       /**< \brief [1:1] ATOM4 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM4_CH2_IRQ:1;       /**< \brief [2:2] ATOM4 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM4_CH3_IRQ:1;       /**< \brief [3:3] ATOM4 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM4_CH4_IRQ:1;       /**< \brief [4:4] ATOM4 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM4_CH5_IRQ:1;       /**< \brief [5:5] ATOM4 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM4_CH6_IRQ:1;       /**< \brief [6:6] ATOM4 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM4_CH7_IRQ:1;       /**< \brief [7:7] ATOM4 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM5_CH1_IRQ:1;       /**< \brief [8:8] ATOM5 channel 10 shared interrupt (rh) */
    Ifx_Strict_32Bit reserved_9:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ATOM5_CH2_IRQ:1;       /**< \brief [10:10] ATOM5 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM5_CH3_IRQ:1;       /**< \brief [11:11] ATOM5 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM5_CH4_IRQ:1;       /**< \brief [12:12] ATOM5 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM5_CH5_IRQ:1;       /**< \brief [13:13] ATOM5 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM5_CH6_IRQ:1;       /**< \brief [14:14] ATOM5 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM5_CH7_IRQ:1;       /**< \brief [15:15] ATOM5 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM6_CH1_IRQ:1;       /**< \brief [16:16] ATOM6 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit reserved_17:1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ATOM6_CH2_IRQ:1;       /**< \brief [18:18] ATOM6 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM6_CH3_IRQ:1;       /**< \brief [19:19] ATOM6 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM6_CH4_IRQ:1;       /**< \brief [20:20] ATOM6 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM6_CH5_IRQ:1;       /**< \brief [21:21] ATOM6 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM6_CH6_IRQ:1;       /**< \brief [22:22] ATOM6 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM6_CH7_IRQ:1;       /**< \brief [23:23] ATOM6 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM7_CH1_IRQ:1;       /**< \brief [24:24] ATOM7 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit reserved_25:1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ATOM7_CH2_IRQ:1;       /**< \brief [26:26] ATOM7 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM7_CH3_IRQ:1;       /**< \brief [27:27] ATOM7 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM7_CH4_IRQ:1;       /**< \brief [28:28] ATOM7 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM7_CH5_IRQ:1;       /**< \brief [29:29] ATOM7 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM7_CH6_IRQ:1;       /**< \brief [30:30] ATOM7 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM7_CH7_IRQ:1;       /**< \brief [31:31] ATOM7 channel 7 shared interrupt (rh) */
} Ifx_GTM_ICM_IRQG_10_Bits;

/** \\brief  ATOM Interrupt Group 2 */
typedef struct _Ifx_GTM_ICM_IRQG_11_Bits
{
    Ifx_Strict_32Bit ATOM8_CH0_IRQ:1;       /**< \brief [0:0] ATOM8 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM8_CH1_IRQ:1;       /**< \brief [1:1] ATOM8 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM8_CH2_IRQ:1;       /**< \brief [2:2] ATOM8 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM8_CH3_IRQ:1;       /**< \brief [3:3] ATOM8 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM8_CH4_IRQ:1;       /**< \brief [4:4] ATOM8 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM8_CH5_IRQ:1;       /**< \brief [5:5] ATOM8 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM8_CH6_IRQ:1;       /**< \brief [6:6] ATOM8 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM8_CH7_IRQ:1;       /**< \brief [7:7] ATOM8 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit reserved_8:24;         /**< \brief \internal Reserved */
} Ifx_GTM_ICM_IRQG_11_Bits;

/** \\brief  GTM DPLL Interrupt Group */
typedef struct _Ifx_GTM_ICM_IRQG_1_Bits
{
    Ifx_Strict_32Bit DPLL_DCG_IRQ:1;        /**< \brief [0:0] TRIGGER direction change detected. (rh) */
    Ifx_Strict_32Bit DPLL_EDI_IRQ:1;        /**< \brief [1:1] DPLL enable/disable interrupt (rh) */
    Ifx_Strict_32Bit DPLL_TIN_IRQ:1;        /**< \brief [2:2] TRIGGER minimum hold time (THMI) violation detected interrupt (rh) */
    Ifx_Strict_32Bit DPLL_TAX_IRQ:1;        /**< \brief [3:3] TRIGGER maximum hold time (THMA) violation detected interrupt (rh) */
    Ifx_Strict_32Bit DPLL_SIS_IRQ:1;        /**< \brief [4:4] STATE inactive slope detected interrupt. See bit 0. (rh) */
    Ifx_Strict_32Bit DPLL_TIS_IRQ:1;        /**< \brief [5:5] TRIGGER inactive slope detected interrupt. See bit 0. (rh) */
    Ifx_Strict_32Bit DPLL_MSI_IRQ:1;        /**< \brief [6:6] Missing STATE interrupt (rh) */
    Ifx_Strict_32Bit DPLL_MTI_IRQ:1;        /**< \brief [7:7] Missing TRIGGER interrupt (rh) */
    Ifx_Strict_32Bit DPLL_SAS_IRQ:1;        /**< \brief [8:8] STATE active slope detected (rh) */
    Ifx_Strict_32Bit DPLL_TAS_IRQ:1;        /**< \brief [9:9] TRIGGER active slope detected while NTI_CNT is zero (rh) */
    Ifx_Strict_32Bit DPLL_PWI_IRQ:1;        /**< \brief [10:10] Plausibility window (PVT) violation interrupt of TRIGGER (rh) */
    Ifx_Strict_32Bit DPLL_W2I_IRQ:1;        /**< \brief [11:11] Write access to RAM region 2 interrupt (rh) */
    Ifx_Strict_32Bit DPLL_W1I_IRQ:1;        /**< \brief [12:12] Write access to RAM region 1B or 1C interrupt (rh) */
    Ifx_Strict_32Bit DPLL_GLI_IRQ:1;        /**< \brief [13:13] Get of lock interrupt for SUB_INC1 (rh) */
    Ifx_Strict_32Bit DPLL_LLI_IRQ:1;        /**< \brief [14:14] Lost of lock interrupt for SUB_INC1 (rh) */
    Ifx_Strict_32Bit DPLL_EI_IRQ:1;         /**< \brief [15:15] Error interrupt See bit 0 (rh) */
    Ifx_Strict_32Bit DPLL_GL2I_IRQ:1;       /**< \brief [16:16] Get of lock interrupt for SUB_INC2 (rh) */
    Ifx_Strict_32Bit DPLL_LL2I_IRQ:1;       /**< \brief [17:17] Lost of lock interrupt for SUB_INC2 (rh) */
    Ifx_Strict_32Bit DPLL_TE0_IRQ:1;        /**< \brief [18:18] TRIGGER event interrupt 0 (rh) */
    Ifx_Strict_32Bit DPLL_TE1_IRQ:1;        /**< \brief [19:19] TRIGGER event interrupt 1 (rh) */
    Ifx_Strict_32Bit DPLL_TE2_IRQ:1;        /**< \brief [20:20] TRIGGER event interrupt 2 (rh) */
    Ifx_Strict_32Bit DPLL_TE3_IRQ:1;        /**< \brief [21:21] TRIGGER event interrupt 3 (rh) */
    Ifx_Strict_32Bit DPLL_TE4_IRQ:1;        /**< \brief [22:22] TRIGGER event interrupt 4 (rh) */
    Ifx_Strict_32Bit DPLL_CDIT_IRQ:1;       /**< \brief [23:23] DPLL calculated duration interrupt for trigger (rh) */
    Ifx_Strict_32Bit DPLL_CDIS_IRQ:1;       /**< \brief [24:24] DPLL calculated duration interrupt for state (rh) */
    Ifx_Strict_32Bit DPLL_TORI_IRQ:1;       /**< \brief [25:25] DPLL calculated duration interrupt for state (rh) */
    Ifx_Strict_32Bit DPLL_SORI_IRQ:1;       /**< \brief [26:26] DPLL calculated duration interrupt for state (rh) */
    Ifx_Strict_32Bit reserved_27:5;         /**< \brief \internal Reserved */
} Ifx_GTM_ICM_IRQG_1_Bits;

