HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_regdef.h
/** \\brief  ITOM Interrupt Group 1 */
typedef struct _Ifx_GTM_ICM_IRQG_7_Bits
{
    Ifx_Strict_32Bit TOM2_CH0_IRQ:1;        /**< \brief [0:0] TOM2 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM2_CH1_IRQ:1;        /**< \brief [1:1] TOM2 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM2_CH2_IRQ:1;        /**< \brief [2:2] TOM2 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM2_CH3_IRQ:1;        /**< \brief [3:3] TOM2 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM2_CH4_IRQ:1;        /**< \brief [4:4] TOM2 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM2_CH5_IRQ:1;        /**< \brief [5:5] TOM2 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM2_CH6_IRQ:1;        /**< \brief [6:6] TOM2 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM2_CH7_IRQ:1;        /**< \brief [7:7] TOM2 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM2_CH8_IRQ:1;        /**< \brief [8:8] TOM2 channel 8 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM2_CH9_IRQ:1;        /**< \brief [9:9] TOM2 channel 9 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM2_CH10_IRQ:1;       /**< \brief [10:10] TOM2 channel 10 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM2_CH11_IRQ:1;       /**< \brief [11:11] TOM2 channel 11 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM2_CH12_IRQ:1;       /**< \brief [12:12] TOM2 channel 12 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM2_CH13_IRQ:1;       /**< \brief [13:13] TOM2 channel 13 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM2_CH14_IRQ:1;       /**< \brief [14:14] TOM2 channel 14 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM2_CH15_IRQ:1;       /**< \brief [15:15] TOM2 channel 15 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM3_CH0_IRQ:1;        /**< \brief [16:16] TOM3 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM3_CH1_IRQ:1;        /**< \brief [17:17] TOM3 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM3_CH2_IRQ:1;        /**< \brief [18:18] TOM3 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM3_CH3_IRQ:1;        /**< \brief [19:19] TOM3 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM3_CH4_IRQ:1;        /**< \brief [20:20] TOM3 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM3_CH5_IRQ:1;        /**< \brief [21:21] TOM3 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM3_CH6_IRQ:1;        /**< \brief [22:22] TOM3 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM3_CH7_IRQ:1;        /**< \brief [23:23] TOM3 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM3_CH8_IRQ:1;        /**< \brief [24:24] TOM3 channel 8 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM3_CH9_IRQ:1;        /**< \brief [25:25] TOM3 channel 9 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM3_CH10_IRQ:1;       /**< \brief [26:26] TOM3 channel 10 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM3_CH11_IRQ:1;       /**< \brief [27:27] TOM3 channel 11 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM3_CH12_IRQ:1;       /**< \brief [28:28] TOM3 channel 12 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM3_CH13_IRQ:1;       /**< \brief [29:29] TOM3 channel 13 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM3_CH14_IRQ:1;       /**< \brief [30:30] TOM3 channel 14 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM3_CH15_IRQ:1;       /**< \brief [31:31] TOM3 channel 15 shared interrupt (rh) */
} Ifx_GTM_ICM_IRQG_7_Bits;

/** \\brief  ITOM Interrupt Group 2 */
typedef struct _Ifx_GTM_ICM_IRQG_8_Bits
{
    Ifx_Strict_32Bit TOM4_CH0_IRQ:1;        /**< \brief [0:0] TOM4 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM4_CH1_IRQ:1;        /**< \brief [1:1] TOM4 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM4_CH2_IRQ:1;        /**< \brief [2:2] TOM4 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM4_CH3_IRQ:1;        /**< \brief [3:3] TOM4 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM4_CH4_IRQ:1;        /**< \brief [4:4] TOM4 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM4_CH5_IRQ:1;        /**< \brief [5:5] TOM4 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM4_CH6_IRQ:1;        /**< \brief [6:6] TOM4 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM4_CH7_IRQ:1;        /**< \brief [7:7] TOM4 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM4_CH8_IRQ:1;        /**< \brief [8:8] TOM4 channel 8 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM4_CH9_IRQ:1;        /**< \brief [9:9] TOM4 channel 9 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM4_CH10_IRQ:1;       /**< \brief [10:10] TOM4 channel 10 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM4_CH11_IRQ:1;       /**< \brief [11:11] TOM4 channel 11 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM4_CH12_IRQ:1;       /**< \brief [12:12] TOM4 channel 12 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM4_CH13_IRQ:1;       /**< \brief [13:13] TOM4 channel 13 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM4_CH14_IRQ:1;       /**< \brief [14:14] TOM4 channel 14 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM4_CH15_IRQ:1;       /**< \brief [15:15] TOM4 channel 15 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM5_CH0_IRQ:1;        /**< \brief [16:16] TOM5 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM5_CH1_IRQ:1;        /**< \brief [17:17] TOM5 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM5_CH2_IRQ:1;        /**< \brief [18:18] TOM5 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM5_CH3_IRQ:1;        /**< \brief [19:19] TOM5 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM5_CH4_IRQ:1;        /**< \brief [20:20] TOM5 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM5_CH5_IRQ:1;        /**< \brief [21:21] TOM5 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM5_CH6_IRQ:1;        /**< \brief [22:22] TOM5 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM5_CH7_IRQ:1;        /**< \brief [23:23] TOM5 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM5_CH8_IRQ:1;        /**< \brief [24:24] TOM5 channel 8 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM5_CH9_IRQ:1;        /**< \brief [25:25] TOM5 channel 9 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM5_CH10_IRQ:1;       /**< \brief [26:26] TOM5 channel 10 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM5_CH11_IRQ:1;       /**< \brief [27:27] TOM5 channel 11 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM5_CH12_IRQ:1;       /**< \brief [28:28] TOM5 channel 12 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM5_CH13_IRQ:1;       /**< \brief [29:29] TOM5 channel 13 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM5_CH14_IRQ:1;       /**< \brief [30:30] TOM5 channel 14 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM5_CH15_IRQ:1;       /**< \brief [31:31] TOM5 channel 15 shared interrupt (rh) */
} Ifx_GTM_ICM_IRQG_8_Bits;

/** \\brief  ATOM Interrupt Group 0 */
typedef struct _Ifx_GTM_ICM_IRQG_9_Bits
{
    Ifx_Strict_32Bit ATOM0_CH0_IRQ:1;       /**< \brief [0:0] ATOM0 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM0_CH1_IRQ:1;       /**< \brief [1:1] ATOM0 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM0_CH2_IRQ:1;       /**< \brief [2:2] ATOM0 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM0_CH3_IRQ:1;       /**< \brief [3:3] ATOM0 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM0_CH4_IRQ:1;       /**< \brief [4:4] ATOM0 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM0_CH5_IRQ:1;       /**< \brief [5:5] ATOM0 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM0_CH6_IRQ:1;       /**< \brief [6:6] ATOM0 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM0_CH7_IRQ:1;       /**< \brief [7:7] ATOM0 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM1_CH0_IRQ:1;       /**< \brief [8:8] ATOM1 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM1_CH1_IRQ:1;       /**< \brief [9:9] ATOM1 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM1_CH2_IRQ:1;       /**< \brief [10:10] ATOM1 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM1_CH3_IRQ:1;       /**< \brief [11:11] ATOM1 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM1_CH4_IRQ:1;       /**< \brief [12:12] ATOM1 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM1_CH5_IRQ:1;       /**< \brief [13:13] ATOM1 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM1_CH6_IRQ:1;       /**< \brief [14:14] ATOM1 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM1_CH7_IRQ:1;       /**< \brief [15:15] ATOM1 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM2_CH0_IRQ:1;       /**< \brief [16:16] ATOM2 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM2_CH1_IRQ:1;       /**< \brief [17:17] ATOM2 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM2_CH2_IRQ:1;       /**< \brief [18:18] ATOM2 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM2_CH3_IRQ:1;       /**< \brief [19:19] ATOM2 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM2_CH4_IRQ:1;       /**< \brief [20:20] ATOM2 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM2_CH5_IRQ:1;       /**< \brief [21:21] ATOM2 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM2_CH6_IRQ:1;       /**< \brief [22:22] ATOM2 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM2_CH7_IRQ:1;       /**< \brief [23:23] ATOM2 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM3_CH0_IRQ:1;       /**< \brief [24:24] ATOM3 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM3_CH1_IRQ:1;       /**< \brief [25:25] ATOM3 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM3_CH2_IRQ:1;       /**< \brief [26:26] ATOM3 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM3_CH3_IRQ:1;       /**< \brief [27:27] ATOM3 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM3_CH4_IRQ:1;       /**< \brief [28:28] ATOM3 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM3_CH5_IRQ:1;       /**< \brief [29:29] ATOM3 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM3_CH6_IRQ:1;       /**< \brief [30:30] ATOM3 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM3_CH7_IRQ:1;       /**< \brief [31:31] ATOM3 channel 7 shared interrupt (rh) */
} Ifx_GTM_ICM_IRQG_9_Bits;

