HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_regdef.h
/** \\brief  ICM Channel Error Interrupt 0 Register */
typedef struct _Ifx_GTM_ICM_IRQG_CEI0_Bits
{
    Ifx_Strict_32Bit FIFO0_CH0_EIRQ:1;      /**< \brief [0:0] FIFO0 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit FIFO0_CH1_EIRQ:1;      /**< \brief [1:1] FIFO0 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO0_CH2_EIRQ:1;      /**< \brief [2:2] FIFO0 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO0_CH3_EIRQ:1;      /**< \brief [3:3] FIFO0 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO0_CH4_EIRQ:1;      /**< \brief [4:4] FIFO0 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO0_CH5_EIRQ:1;      /**< \brief [5:5] FIFO0 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO0_CH6_EIRQ:1;      /**< \brief [6:6] FIFO0 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO0_CH7_EIRQ:1;      /**< \brief [7:7] FIFO0 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO1_CH0_EIRQ:1;      /**< \brief [8:8] FIFO1 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO1_CH1_EIRQ:1;      /**< \brief [9:9] FIFO1 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO1_CH2_EIRQ:1;      /**< \brief [10:10] FIFO1 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO1_CH3_EIRQ:1;      /**< \brief [11:11] FIFO1 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO1_CH4_EIRQ:1;      /**< \brief [12:12] FIFO1 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO1_CH5_EIRQ:1;      /**< \brief [13:13] FIFO1 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO1_CH6_EIRQ:1;      /**< \brief [14:14] FIFO1 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit FIFO1_CH7_EIRQ:1;      /**< \brief [15:15] FIFO1 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit reserved_16:16;        /**< \brief \internal Reserved */
} Ifx_GTM_ICM_IRQG_CEI0_Bits;

/** \\brief  ICM Channel Error Interrupt 1 Register */
typedef struct _Ifx_GTM_ICM_IRQG_CEI1_Bits
{
    Ifx_Strict_32Bit TIM0_CH0_EIRQ:1;       /**< \brief [0:0] TIM0 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit TIM0_CH1_EIRQ:1;       /**< \brief [1:1] TIM0 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit TIM0_CH2_EIRQ:1;       /**< \brief [2:2] TIM0 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit TIM0_CH3_EIRQ:1;       /**< \brief [3:3] TIM0 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit TIM0_CH4_EIRQ:1;       /**< \brief [4:4] TIM0 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit TIM0_CH5_EIRQ:1;       /**< \brief [5:5] TIM0 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit TIM0_CH6_EIRQ:1;       /**< \brief [6:6] TIM0 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit TIM0_CH7_EIRQ:1;       /**< \brief [7:7] TIM0 channel 7 error interrupt (rh) */
    Ifx_Strict_32Bit TIM1_CH0_EIRQ:1;       /**< \brief [8:8] TIM1 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit TIM1_CH1_EIRQ:1;       /**< \brief [9:9] TIM1 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit TIM1_CH2_EIRQ:1;       /**< \brief [10:10] TIM1 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit TIM1_CH3_EIRQ:1;       /**< \brief [11:11] TIM1 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit TIM1_CH4_EIRQ:1;       /**< \brief [12:12] TIM1 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit TIM1_CH5_EIRQ:1;       /**< \brief [13:13] TIM1 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit TIM1_CH6_EIRQ:1;       /**< \brief [14:14] TIM1 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit TIM1_CH7_EIRQ:1;       /**< \brief [15:15] TIM1 channel 7 error interrupt (rh) */
    Ifx_Strict_32Bit TIM2_CH0_EIRQ:1;       /**< \brief [16:16] TIM2 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit TIM2_CH1_EIRQ:1;       /**< \brief [17:17] TIM2 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit TIM2_CH2_EIRQ:1;       /**< \brief [18:18] TIM2 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit TIM2_CH3_EIRQ:1;       /**< \brief [19:19] TIM2 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit TIM2_CH4_EIRQ:1;       /**< \brief [20:20] TIM2 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit TIM2_CH5_EIRQ:1;       /**< \brief [21:21] TIM2 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit TIM2_CH6_EIRQ:1;       /**< \brief [22:22] TIM2 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit TIM2_CH7_EIRQ:1;       /**< \brief [23:23] TIM2 channel 7 error interrupt (rh) */
    Ifx_Strict_32Bit TIM3_CH0_EIRQ:1;       /**< \brief [24:24] TIM3 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit TIM3_CH1_EIRQ:1;       /**< \brief [25:25] TIM3 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit TIM3_CH2_EIRQ:1;       /**< \brief [26:26] TIM3 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit TIM3_CH3_EIRQ:1;       /**< \brief [27:27] TIM3 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit TIM3_CH4_EIRQ:1;       /**< \brief [28:28] TIM3 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit TIM3_CH5_IRQ:1;        /**< \brief [29:29] TIM3 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit TIM3_CH6_EIRQ:1;       /**< \brief [30:30] TIM3 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit TIM3_CH7_EIRQ:1;       /**< \brief [31:31] TIM3 channel 7 error interrupt (rh) */
} Ifx_GTM_ICM_IRQG_CEI1_Bits;

/** \\brief  ICM Channel Error Interrupt 2 Register */
typedef struct _Ifx_GTM_ICM_IRQG_CEI2_Bits
{
    Ifx_Strict_32Bit TIM4_CH0_EIRQ:1;       /**< \brief [0:0] TIM4 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit TIM4_CH1_EIRQ:1;       /**< \brief [1:1] TIM4 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit TIM4_CH2_EIRQ:1;       /**< \brief [2:2] TIM4 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit TIM4_CH3_EIRQ:1;       /**< \brief [3:3] TIM4 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit TIM4_CH4_EIRQ:1;       /**< \brief [4:4] TIM4 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit TIM4_CH5_EIRQ:1;       /**< \brief [5:5] TIM4 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit TIM4_CH6_EIRQ:1;       /**< \brief [6:6] TIM4 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit TIM4_CH7_EIRQ:1;       /**< \brief [7:7] TIM4 channel 7 error interrupt (rh) */
    Ifx_Strict_32Bit TIM5_CH0_EIRQ:1;       /**< \brief [8:8] TIM5 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit TIM5_CH1_EIRQ:1;       /**< \brief [9:9] TIM5 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit TIM5_CH2_EIRQ:1;       /**< \brief [10:10] TIM5 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit TIM5_CH3_EIRQ:1;       /**< \brief [11:11] TIM5 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit TIM5_CH4_EIRQ:1;       /**< \brief [12:12] TIM5 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit TIM5_CH5_EIRQ:1;       /**< \brief [13:13] TIM5 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit TIM5_CH6_EIRQ:1;       /**< \brief [14:14] TIM5 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit TIM5_CH7_EIRQ:1;       /**< \brief [15:15] TIM5 channel 7 error interrupt (rh) */
    Ifx_Strict_32Bit reserved_16:16;        /**< \brief \internal Reserved */
} Ifx_GTM_ICM_IRQG_CEI2_Bits;

/** \\brief  ICM Channel Error Interrupt 3 Register */
typedef struct _Ifx_GTM_ICM_IRQG_CEI3_Bits
{
    Ifx_Strict_32Bit MCS0_CH0_EIRQ:1;       /**< \brief [0:0] MCS0 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH1_EIRQ:1;       /**< \brief [1:1] MCS0 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH2_EIRQ:1;       /**< \brief [2:2] MCS0 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH3_EIRQ:1;       /**< \brief [3:3] MCS0 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH4_EIRQ:1;       /**< \brief [4:4] MCS0 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH5_EIRQ:1;       /**< \brief [5:5] MCS0 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH6_EIRQ:1;       /**< \brief [6:6] MCS0 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH7_EIRQ:1;       /**< \brief [7:7] MCS0 channel 7 error interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH0_EIRQ:1;       /**< \brief [8:8] MCS1 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH1_EIRQ:1;       /**< \brief [9:9] MCS1 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH2_EIRQ:1;       /**< \brief [10:10] MCS1 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH3_EIRQ:1;       /**< \brief [11:11] MCS1 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH4_EIRQ:1;       /**< \brief [12:12] MCS1 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH5_EIRQ:1;       /**< \brief [13:13] MCS1 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH6_EIRQ:1;       /**< \brief [14:14] MCS1 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH7_EIRQ:1;       /**< \brief [15:15] MCS1 channel 7 error interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH0_EIRQ:1;       /**< \brief [16:16] MCS2 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH1_EIRQ:1;       /**< \brief [17:17] MCS2 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH2_EIRQ:1;       /**< \brief [18:18] MCS2 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH3_EIRQ:1;       /**< \brief [19:19] MCS2 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH4_EIRQ:1;       /**< \brief [20:20] MCS2 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH5_EIRQ:1;       /**< \brief [21:21] MCS2 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH6_EIRQ:1;       /**< \brief [22:22] MCS2 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH7_EIRQ:1;       /**< \brief [23:23] MCS2 channel 7 error interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH0_EIRQ:1;       /**< \brief [24:24] MCS3 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH1_EIRQ:1;       /**< \brief [25:25] MCS3 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH2_EIRQ:1;       /**< \brief [26:26] MCS3 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH3_EIRQ:1;       /**< \brief [27:27] MCS3 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH4_EIRQ:1;       /**< \brief [28:28] MCS3 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH5_EIRQ:1;       /**< \brief [29:29] MCS3 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH6_EIRQ:1;       /**< \brief [30:30] MCS3 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH7_EIRQ:1;       /**< \brief [31:31] MCS3 channel 7 error interrupt (rh) */
} Ifx_GTM_ICM_IRQG_CEI3_Bits;

/** \\brief  ICM Channel Error Interrupt 4 Register */
typedef struct _Ifx_GTM_ICM_IRQG_CEI4_Bits
{
    Ifx_Strict_32Bit MCS4_CH0_EIRQ:1;       /**< \brief [0:0] MCS4 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit MCS4_CH1_EIRQ:1;       /**< \brief [1:1] MCS4 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit MCS4_CH2_EIRQ:1;       /**< \brief [2:2] MCS4 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit MCS4_CH3_EIRQ:1;       /**< \brief [3:3] MCS4 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit MCS4_CH4_EIRQ:1;       /**< \brief [4:4] MCS4 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit MCS4_CH5_EIRQ:1;       /**< \brief [5:5] MCS4 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit MCS4_CH6_EIRQ:1;       /**< \brief [6:6] MCS4 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit MCS4_CH7_EIRQ:1;       /**< \brief [7:7] MCS4 channel 7 error interrupt (rh) */
    Ifx_Strict_32Bit MCS5_CH0_EIRQ:1;       /**< \brief [8:8] MCS5 channel 0 error interrupt (rh) */
    Ifx_Strict_32Bit MCS5_CH1_EIRQ:1;       /**< \brief [9:9] MCS5 channel 1 error interrupt (rh) */
    Ifx_Strict_32Bit MCS5_CH2_EIRQ:1;       /**< \brief [10:10] MCS5 channel 2 error interrupt (rh) */
    Ifx_Strict_32Bit MCS5_CH3_EIRQ:1;       /**< \brief [11:11] MCS5 channel 3 error interrupt (rh) */
    Ifx_Strict_32Bit MCS5_CH4_EIRQ:1;       /**< \brief [12:12] MCS5 channel 4 error interrupt (rh) */
    Ifx_Strict_32Bit MCS5_CH5_EIRQ:1;       /**< \brief [13:13] MCS5 channel 5 error interrupt (rh) */
    Ifx_Strict_32Bit MCS5_CH6_EIRQ:1;       /**< \brief [14:14] MCS5 channel 6 error interrupt (rh) */
    Ifx_Strict_32Bit MCS5_CH7_EIRQ:1;       /**< \brief [15:15] MCS5 channel 7 error interrupt (rh) */
    Ifx_Strict_32Bit reserved_16:16;        /**< \brief \internal Reserved */
} Ifx_GTM_ICM_IRQG_CEI4_Bits;

/** \\brief  ICM Module Error Interrupt Register */
typedef struct _Ifx_GTM_ICM_IRQG_MEI_Bits
{
    Ifx_Strict_32Bit GTM_EIRQ:1;            /**< \brief [0:0] GTM Error interrupt request (rh) */
    Ifx_Strict_32Bit BRC_EIRQ:1;            /**< \brief [1:1] BRC error interrupt (rh) */
    Ifx_Strict_32Bit FIFO0_EIRQ:1;          /**< \brief [2:2] FIFO0 error interrupt (rh) */
    Ifx_Strict_32Bit FIFO1_EIRQ:1;          /**< \brief [3:3] FIFO1 error interrupt (rh) */
    Ifx_Strict_32Bit TIM0_EIRQ:1;           /**< \brief [4:4] TIM0 error interrupt (rh) */
    Ifx_Strict_32Bit TIM1_EIRQ:1;           /**< \brief [5:5] TIM1 error interrupt (rh) */
    Ifx_Strict_32Bit TIM2_EIRQ:1;           /**< \brief [6:6] TIM2 error interrupt (rh) */
    Ifx_Strict_32Bit TIM3_EIRQ:1;           /**< \brief [7:7] TIM3 error interrupt (rh) */
    Ifx_Strict_32Bit TIM4_EIRQ:1;           /**< \brief [8:8] TIM4 error interrupt (rh) */
    Ifx_Strict_32Bit TIM5_EIRQ:1;           /**< \brief [9:9] TIM5 error interrupt (rh) */
    Ifx_Strict_32Bit reserved_10:2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit MCS0_EIRQ:1;           /**< \brief [12:12] MCS0 error interrupt (rh) */
    Ifx_Strict_32Bit MCS1_EIRQ:1;           /**< \brief [13:13] MCS1 error interrupt (rh) */
    Ifx_Strict_32Bit MCS2_EIRQ:1;           /**< \brief [14:14] MCS2 error interrupt (rh) */
    Ifx_Strict_32Bit MCS3_EIRQ:1;           /**< \brief [15:15] MCS3 error interrupt (rh) */
    Ifx_Strict_32Bit MCS4_EIRQ:1;           /**< \brief [16:16] MCS4 error interrupt (rh) */
    Ifx_Strict_32Bit MCS5_EIRQ:1;           /**< \brief [17:17] MCS5 error interrupt (rh) */
    Ifx_Strict_32Bit reserved_18:2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SPE0_EIRQ:1;           /**< \brief [20:20] SPE0 error interrupt (rh) */
    Ifx_Strict_32Bit SPE1_EIRQ:1;           /**< \brief [21:21] SPE1 error interrupt (rh) */
    Ifx_Strict_32Bit SPE2_EIRQ:1;           /**< \brief [22:22] SPE2 error interrupt (rh) */
    Ifx_Strict_32Bit SPE3_EIRQ:1;           /**< \brief [23:23] SPE3 error interrupt (rh) */
    Ifx_Strict_32Bit CMP_EIRQ:1;            /**< \brief [24:24] CMP error interrupt (rh) */
    Ifx_Strict_32Bit DPLL_EIRQ:1;           /**< \brief [25:25] DPLL error interrupt (rh) */
    Ifx_Strict_32Bit reserved_26:6;         /**< \brief \internal Reserved */
} Ifx_GTM_ICM_IRQG_MEI_Bits;

/** \\brief  CAN Output Select Register */
typedef struct _Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits
{
    Ifx_Strict_32Bit SEL0:4;                /**< \brief [3:0] Output Selection for CAN GTM connection (rw) */
    Ifx_Strict_32Bit SEL1:4;                /**< \brief [7:4] Output Selection for CAN GTM connection (rw) */
    Ifx_Strict_32Bit SEL2:4;                /**< \brief [11:8] Output Selection for CAN GTM connection (rw) */
    Ifx_Strict_32Bit SEL3:4;                /**< \brief [15:12] Output Selection for CAN GTM connection (rw) */
    Ifx_Strict_32Bit SEL4:4;                /**< \brief [19:16] Output Selection for CAN GTM connection (rw) */
    Ifx_Strict_32Bit SEL5:4;                /**< \brief [23:20] Output Selection for CAN GTM connection (rw) */
    Ifx_Strict_32Bit SEL6:4;                /**< \brief [27:24] Output Selection for CAN GTM connection (rw) */
    Ifx_Strict_32Bit SEL7:4;                /**< \brief [31:28] Output Selection for CAN GTM connection (rw) */
} Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits;

