HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_regdef.h
/** \\brief  MCS IRQ Mode Configuration Register */
typedef struct _Ifx_GTM_MCS_CH_IRQ_MODE_Bits
{
    Ifx_Strict_32Bit IRQ_MODE:2;            /**< \brief [1:0] IRQ mode selection (rw) */
    Ifx_Strict_32Bit reserved_2:30;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_IRQ_MODE_Bits;

/** \\brief  MCS Channel interrupt notification register */
typedef struct _Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits
{
    Ifx_Strict_32Bit MCS_IRQ:1;             /**< \brief [0:0] Interrupt request by MCS-channel x (rwh) */
    Ifx_Strict_32Bit STK_ERR_IRQ:1;         /**< \brief [1:1] Stack counter overflow/underflow of channel x (rwh) */
    Ifx_Strict_32Bit MEM_ERR_IRQ:1;         /**< \brief [2:2] Memory access out of range in channel x (rwh) */
    Ifx_Strict_32Bit reserved_3:29;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits;

/** \\brief  MCS Channel Program Counter Register */
typedef struct _Ifx_GTM_MCS_CH_PC_Bits
{
    Ifx_Strict_32Bit PC:14;                 /**< \brief [13:0] Current Program Counter (rw) */
    Ifx_Strict_32Bit reserved_14:18;        /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_PC_Bits;

/** \\brief  MCS Channel Program Counter Register 0 */
typedef struct _Ifx_GTM_MCS_CH_R0_Bits
{
    Ifx_Strict_32Bit DATA:24;               /**< \brief [23:0] Data of MCS general purpose register ry (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_R0_Bits;

/** \\brief  MCS Channel Program Counter Register 1 */
typedef struct _Ifx_GTM_MCS_CH_R1_Bits
{
    Ifx_Strict_32Bit DATA:24;               /**< \brief [23:0] Data of MCS general purpose register ry (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_R1_Bits;

/** \\brief  MCS Channel Program Counter Register 2 */
typedef struct _Ifx_GTM_MCS_CH_R2_Bits
{
    Ifx_Strict_32Bit DATA:24;               /**< \brief [23:0] Data of MCS general purpose register ry (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_R2_Bits;

/** \\brief  MCS Channel Program Counter Register 3 */
typedef struct _Ifx_GTM_MCS_CH_R3_Bits
{
    Ifx_Strict_32Bit DATA:24;               /**< \brief [23:0] Data of MCS general purpose register ry (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_R3_Bits;

/** \\brief  MCS Channel Program Counter Register 4 */
typedef struct _Ifx_GTM_MCS_CH_R4_Bits
{
    Ifx_Strict_32Bit DATA:24;               /**< \brief [23:0] Data of MCS general purpose register ry (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_R4_Bits;

/** \\brief  MCS Channel Program Counter Register 5 */
typedef struct _Ifx_GTM_MCS_CH_R5_Bits
{
    Ifx_Strict_32Bit DATA:24;               /**< \brief [23:0] Data of MCS general purpose register ry (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_R5_Bits;

/** \\brief  MCS Channel Program Counter Register 6 */
typedef struct _Ifx_GTM_MCS_CH_R6_Bits
{
    Ifx_Strict_32Bit DATA:24;               /**< \brief [23:0] Data of MCS general purpose register ry (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_R6_Bits;

/** \\brief  MCS Channel Program Counter Register 7 */
typedef struct _Ifx_GTM_MCS_CH_R7_Bits
{
    Ifx_Strict_32Bit DATA:24;               /**< \brief [23:0] Data of MCS general purpose register ry (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_R7_Bits;

/** \\brief  MCS Control Register */
typedef struct _Ifx_GTM_MCS_CTRL_Bits
{
    Ifx_Strict_32Bit SCHED:1;               /**< \brief [0:0] MCS submodule scheduling scheme (rw) */
    Ifx_Strict_32Bit HLT_SP_OFL:1;          /**< \brief [1:1] Halt on stack pointer overflow (rw) */
    Ifx_Strict_32Bit reserved_2:14;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit RAM_RST:1;             /**< \brief [16:16] RAM reset bit (r) */
    Ifx_Strict_32Bit reserved_17:15;        /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CTRL_Bits;

/** \\brief  MCS Error Register */
typedef struct _Ifx_GTM_MCS_ERR_Bits
{
    Ifx_Strict_32Bit ERR0:1;                /**< \brief [0:0] Error State of MCS-channel 0 (rwh) */
    Ifx_Strict_32Bit ERR1:1;                /**< \brief [1:1] Error State of MCS-channel 1 (rwh) */
    Ifx_Strict_32Bit ERR2:1;                /**< \brief [2:2] Error State of MCS-channel 2 (rwh) */
    Ifx_Strict_32Bit ERR3:1;                /**< \brief [3:3] Error State of MCS-channel3 (rwh) */
    Ifx_Strict_32Bit ERR4:1;                /**< \brief [4:4] Error State of MCS-channel 4 (rwh) */
    Ifx_Strict_32Bit ERR5:1;                /**< \brief [5:5] Error State of MCS-channel 5 (rwh) */
    Ifx_Strict_32Bit ERR6:1;                /**< \brief [6:6] Error State of MCS-channel 6 (rwh) */
    Ifx_Strict_32Bit ERR7:1;                /**< \brief [7:7] Error State of MCS-channel 7 (rwh) */
    Ifx_Strict_32Bit reserved_8:24;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_ERR_Bits;

/** \\brief  MCS Channel Reset Register */
typedef struct _Ifx_GTM_MCS_RST_Bits
{
    Ifx_Strict_32Bit RST0:1;                /**< \brief [0:0] Software reset of channel 0 (w) */
    Ifx_Strict_32Bit RST1:1;                /**< \brief [1:1] Software reset of channel 1 (w) */
    Ifx_Strict_32Bit RST2:1;                /**< \brief [2:2] Software reset of channel 2 (w) */
    Ifx_Strict_32Bit RST3:1;                /**< \brief [3:3] Software reset of channel 3 (w) */
    Ifx_Strict_32Bit RST4:1;                /**< \brief [4:4] Software reset of channel 4 (w) */
    Ifx_Strict_32Bit RST5:1;                /**< \brief [5:5] Software reset of channel 5 (w) */
    Ifx_Strict_32Bit RST6:1;                /**< \brief [6:6] Software reset of channel 6 (w) */
    Ifx_Strict_32Bit RST7:1;                /**< \brief [7:7] Software reset of channel 7 (w) */
    Ifx_Strict_32Bit CAT0:1;                /**< \brief [8:8] Cancel ARU transfer for channel 0 (rwh) */
    Ifx_Strict_32Bit CAT1:1;                /**< \brief [9:9] Cancel ARU transfer for channel 1 (rwh) */
    Ifx_Strict_32Bit CAT2:1;                /**< \brief [10:10] Cancel ARU transfer for channel 2 (rwh) */
    Ifx_Strict_32Bit CAT3:1;                /**< \brief [11:11] Cancel ARU transfer for channel 3 (rwh) */
    Ifx_Strict_32Bit CAT4:1;                /**< \brief [12:12] Cancel ARU transfer for channel 4 (rwh) */
    Ifx_Strict_32Bit CAT5:1;                /**< \brief [13:13] Cancel ARU transfer for channel 5 (rwh) */
    Ifx_Strict_32Bit CAT6:1;                /**< \brief [14:14] Cancel ARU transfer for channel 6 (rwh) */
    Ifx_Strict_32Bit CAT7:1;                /**< \brief [15:15] Cancel ARU transfer for channel 7 (rwh) */
    Ifx_Strict_32Bit CWT0:1;                /**< \brief [16:16] Cancel WURM instruction for channel 0 (rwh) */
    Ifx_Strict_32Bit CWT1:1;                /**< \brief [17:17] Cancel WURM instruction for channel 1 (rwh) */
    Ifx_Strict_32Bit CWT2:1;                /**< \brief [18:18] Cancel WURM instruction for channel 2 (rwh) */
    Ifx_Strict_32Bit CWT3:1;                /**< \brief [19:19] Cancel WURM instruction for channel 3 (rwh) */
    Ifx_Strict_32Bit CWT4:1;                /**< \brief [20:20] Cancel WURM instruction for channel 4 (rwh) */
    Ifx_Strict_32Bit CWT5:1;                /**< \brief [21:21] Cancel WURM instruction for channel 5 (rwh) */
    Ifx_Strict_32Bit CWT6:1;                /**< \brief [22:22] Cancel WURM instruction for channel 6 (rwh) */
    Ifx_Strict_32Bit CWT7:1;                /**< \brief [23:23] Cancel WURM instruction for channel 7 (rwh) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_RST_Bits;

/** \\brief  MCS Interrupt Clear Register */
typedef struct _Ifx_GTM_MCSINTCLR_Bits
{
    Ifx_Strict_32Bit MCS000:1;              /**< \brief [0:0] MCS0 RAM0 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS001:1;              /**< \brief [1:1] MCS0 RAM0 Interrupt 1 Status Clear (w) */
    Ifx_Strict_32Bit MCS010:1;              /**< \brief [2:2] MCS0 RAM1 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS011:1;              /**< \brief [3:3] MCS0 RAM1 Interrupt 1 Status Clear (w) */
    Ifx_Strict_32Bit MCS100:1;              /**< \brief [4:4] MCS1 RAM0 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS101:1;              /**< \brief [5:5] MCS1 RAM0 Interrupt 1 Status Clear (w) */
    Ifx_Strict_32Bit MCS110:1;              /**< \brief [6:6] MCS1 RAM1 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS111:1;              /**< \brief [7:7] MCS1 RAM1 Interrupt 1 Status Clear (w) */
    Ifx_Strict_32Bit MCS200:1;              /**< \brief [8:8] MCS2 RAM0 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS201:1;              /**< \brief [9:9] MCS2 RAM0 Interrupt 1 Status Clear (w) */
    Ifx_Strict_32Bit MCS210:1;              /**< \brief [10:10] MCS2 RAM1 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS211:1;              /**< \brief [11:11] MCS2 RAM1 Interrupt 1 Status Clear (w) */
    Ifx_Strict_32Bit MCS300:1;              /**< \brief [12:12] MCS3 RAM0 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS301:1;              /**< \brief [13:13] MCS3 RAM0 Interrupt 1 Status Clear (w) */
    Ifx_Strict_32Bit MCS310:1;              /**< \brief [14:14] MCS3 RAM1 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS311:1;              /**< \brief [15:15] MCS3 RAM1 Interrupt 1 Status Clear (w) */
    Ifx_Strict_32Bit MCS400:1;              /**< \brief [16:16] MCS4 RAM0 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS401:1;              /**< \brief [17:17] MCS4 RAM0 Interrupt 1 Status Clear (w) */
    Ifx_Strict_32Bit MCS410:1;              /**< \brief [18:18] MCS4 RAM1 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS411:1;              /**< \brief [19:19] MCS4 RAM1 Interrupt 1 Status Clear (w) */
    Ifx_Strict_32Bit MCS500:1;              /**< \brief [20:20] MCS5 RAM0 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS501:1;              /**< \brief [21:21] MCS5 RAM0 Interrupt 1 Status Clear (w) */
    Ifx_Strict_32Bit MCS510:1;              /**< \brief [22:22] MCS5 RAM1 Interrupt 0 Status Clear (w) */
    Ifx_Strict_32Bit MCS511:1;              /**< \brief [23:23] MCS5 RAM1 Interrupt 1 Status Clear (w) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCSINTCLR_Bits;

/** \\brief  MCS Interrupt Status Register */
typedef struct _Ifx_GTM_MCSINTSTAT_Bits
{
    Ifx_Strict_32Bit MCS000:1;              /**< \brief [0:0] MCS0 RAM0 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS001:1;              /**< \brief [1:1] MCS0 RAM0 Interrupt 1 Status (rh) */
    Ifx_Strict_32Bit MCS010:1;              /**< \brief [2:2] MCS0 RAM1 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS011:1;              /**< \brief [3:3] MCS0 RAM1 Interrupt 1 Status (rh) */
    Ifx_Strict_32Bit MCS100:1;              /**< \brief [4:4] MCS1 RAM0 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS101:1;              /**< \brief [5:5] MCS1 RAM0 Interrupt 1 Status (rh) */
    Ifx_Strict_32Bit MCS110:1;              /**< \brief [6:6] MCS1 RAM1 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS111:1;              /**< \brief [7:7] MCS1 RAM1 Interrupt 1 Status (rh) */
    Ifx_Strict_32Bit MCS200:1;              /**< \brief [8:8] MCS2 RAM0 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS201:1;              /**< \brief [9:9] MCS2 RAM0 Interrupt 1 Status (rh) */
    Ifx_Strict_32Bit MCS210:1;              /**< \brief [10:10] MCS2 RAM1 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS211:1;              /**< \brief [11:11] MCS2 RAM1 Interrupt 1 Status (rh) */
    Ifx_Strict_32Bit MCS300:1;              /**< \brief [12:12] MCS3 RAM0 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS301:1;              /**< \brief [13:13] MCS3 RAM0 Interrupt 1 Status (rh) */
    Ifx_Strict_32Bit MCS310:1;              /**< \brief [14:14] MCS3 RAM1 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS311:1;              /**< \brief [15:15] MCS3 RAM1 Interrupt 1 Status (rh) */
    Ifx_Strict_32Bit MCS400:1;              /**< \brief [16:16] MCS4 RAM0 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS401:1;              /**< \brief [17:17] MCS4 RAM0 Interrupt 1 Status (rh) */
    Ifx_Strict_32Bit MCS410:1;              /**< \brief [18:18] MCS4 RAM1 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS411:1;              /**< \brief [19:19] MCS4 RAM1 Interrupt 1 Status (rh) */
    Ifx_Strict_32Bit MCS500:1;              /**< \brief [20:20] MCS5 RAM0 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS501:1;              /**< \brief [21:21] MCS5 RAM0 Interrupt 1 Status (rh) */
    Ifx_Strict_32Bit MCS510:1;              /**< \brief [22:22] MCS5 RAM1 Interrupt 0 Status (rh) */
    Ifx_Strict_32Bit MCS511:1;              /**< \brief [23:23] MCS5 RAM1 Interrupt 1 Status (rh) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCSINTSTAT_Bits;

/** \\brief  Monitor Activity Register 0 */
typedef struct _Ifx_GTM_MON_ACTIVITY_0_Bits
{
    Ifx_Strict_32Bit MCA_0_0:1;             /**< \brief [0:0] Activity of check performed in module MCS0 at channel 0 (rwh) */
    Ifx_Strict_32Bit MCA_0_1:1;             /**< \brief [1:1] Activity of check performed in module MCS0 at channel 1 (rwh) */
    Ifx_Strict_32Bit MCA_0_2:1;             /**< \brief [2:2] Activity of check performed in module MCS0 at channel 2 (rwh) */
    Ifx_Strict_32Bit MCA_0_3:1;             /**< \brief [3:3] Activity of check performed in module MCS0 at channel 3 (rwh) */
    Ifx_Strict_32Bit MCA_0_4:1;             /**< \brief [4:4] Activity of check performed in module MCS0 at channel 4 (rwh) */
    Ifx_Strict_32Bit MCA_0_5:1;             /**< \brief [5:5] Activity of check performed in module MCS0 at channel 5 (rwh) */
    Ifx_Strict_32Bit MCA_0_6:1;             /**< \brief [6:6] Activity of check performed in module MCS0 at channel 6 (rwh) */
    Ifx_Strict_32Bit MCA_0_7:1;             /**< \brief [7:7] Activity of check performed in module MCS0 at channel 7 (rwh) */
    Ifx_Strict_32Bit MCA_1_0:1;             /**< \brief [8:8] Activity of check performed in module MCS1 at channel 0 (rwh) */
    Ifx_Strict_32Bit MCA_1_1:1;             /**< \brief [9:9] Activity of check performed in module MCS1 at channel 1 (rwh) */
    Ifx_Strict_32Bit MCA_1_2:1;             /**< \brief [10:10] Activity of check performed in module MCS1 at channel 2 (rwh) */
    Ifx_Strict_32Bit MCA_1_3:1;             /**< \brief [11:11] Activity of check performed in module MCS1 at channel 3 (rwh) */
    Ifx_Strict_32Bit MCA_1_4:1;             /**< \brief [12:12] Activity of check performed in module MCS1 at channel 4 (rwh) */
    Ifx_Strict_32Bit MCA_1_5:1;             /**< \brief [13:13] Activity of check performed in module MCS1 at channel 5 (rwh) */
    Ifx_Strict_32Bit MCA_1_6:1;             /**< \brief [14:14] Activity of check performed in module MCS1 at channel 6 (rwh) */
    Ifx_Strict_32Bit MCA_1_7:1;             /**< \brief [15:15] Activity of check performed in module MCS1 at channel 7 (rwh) */
    Ifx_Strict_32Bit MCA_2_0:1;             /**< \brief [16:16] Activity of check performed in module MCS2 at channel 0 (rwh) */
    Ifx_Strict_32Bit MCA_2_1:1;             /**< \brief [17:17] Activity of check performed in module MCS2 at channel 1 (rwh) */
    Ifx_Strict_32Bit MCA_2_2:1;             /**< \brief [18:18] Activity of check performed in module MCS2 at channel 2 (rwh) */
    Ifx_Strict_32Bit MCA_2_3:1;             /**< \brief [19:19] Activity of check performed in module MCS2 at channel 3 (rwh) */
    Ifx_Strict_32Bit MCA_2_4:1;             /**< \brief [20:20] Activity of check performed in module MCS2 at channel 4 (rwh) */
    Ifx_Strict_32Bit MCA_2_5:1;             /**< \brief [21:21] Activity of check performed in module MCS2 at channel 5 (rwh) */
    Ifx_Strict_32Bit MCA_2_6:1;             /**< \brief [22:22] Activity of check performed in module MCS2 at channel 6 (rwh) */
    Ifx_Strict_32Bit MCA_2_7:1;             /**< \brief [23:23] Activity of check performed in module MCS2 at channel 7 (rwh) */
    Ifx_Strict_32Bit MCA_3_0:1;             /**< \brief [24:24] Activity of check performed in module MCS3 at channel 0 (rwh) */
    Ifx_Strict_32Bit MCA_3_1:1;             /**< \brief [25:25] Activity of check performed in module MCS3 at channel 1 (rwh) */
    Ifx_Strict_32Bit MCA_3_2:1;             /**< \brief [26:26] Activity of check performed in module MCS3 at channel 2 (rwh) */
    Ifx_Strict_32Bit MCA_3_3:1;             /**< \brief [27:27] Activity of check performed in module MCS3 at channel 3 (rwh) */
    Ifx_Strict_32Bit MCA_3_4:1;             /**< \brief [28:28] Activity of check performed in module MCS3 at channel 4 (rwh) */
    Ifx_Strict_32Bit MCA_3_5:1;             /**< \brief [29:29] Activity of check performed in module MCS3 at channel 5 (rwh) */
    Ifx_Strict_32Bit MCA_3_6:1;             /**< \brief [30:30] Activity of check performed in module MCS3 at channel 6 (rwh) */
    Ifx_Strict_32Bit MCA_3_7:1;             /**< \brief [31:31] Activity of check performed in module MCS3 at channel 7 (rwh) */
} Ifx_GTM_MON_ACTIVITY_0_Bits;

